app/controllers/movies_controller.rb

  def update
    if @movie.update(movie_params)
---
UPDATE "movies" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "movies"."id" = 1  [["title", "Updated Movie Title"], ["description", "\nTony Stark builds an armored suit to fight the throes of evil"], ["updated_at", Sat, 28 Sep 2013 21:43:05 UTC +00:00]]

  def set_movie
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE (released_on <= '2013-09-28 21:44:17.159589') ORDER BY released_on desc