app/controllers/reviews_controller.rb

	def edit
		@review = Review.find params[:id]
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "2"]]

	def update
		@review = Review.find params[:id]
    if @review.update(review_params)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "reviews" SET "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = 2  [["comment", "This movie stank!"], ["updated_at", Sun, 06 Oct 2013 17:36:50 UTC +00:00]]

	def destroy
		@review = Review.find params[:id]
		@review.destroy
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]